#include <iostream> // для работы с потоками ввода/вывода
#include <string> // для работы со строками

using namespace std;

int main()
{
	setlocale(LC_ALL, ".UTF8"); // Поставили кириллицу в консоли

#pragma region Определение массивов
	/* Массив - упорядоченный нумерованый набор однотипных данных */
	/* Когда мы инициализируем массив, мы выделяем в памяти фиксированное число ячеек размером конкретного типа. */

	// Варианты инициализации
	// 1) Явный, типПеременной названиеМассива [число длины]
	int numbers[3];

	// 2) Явный неполный, в таком случае оставшимся пустым ячейкам присваевается дефолтное значение
	int numbers2[4]{ 3, 5 }; // эквивалентно int numbers3[4]{ 3, 5, 0, 0 };

	// 3) Неявный, типПеременной название массива[] = { перечень, значений }
	int numbers3[] = { 3, 5, 7 }; // размер массива будет равен количеству переданных значений
#pragma endregion

#pragma region Работа с массивом
#pragma region Работа с элементами массива. Обращение по индексу
	// Работа с элементами массива
	/* Массив представляет из себя нумерованый список элементов, поэтому при взаимодействии с массивом можно обращаться к каждому элементу
	по его номеру.
	!! ВАЖНО !! Нумерация позиций в массиве начинается с нуля */

	// Примеры обращения:
	int example[]{ 1, 2, 4, 7 };
	// имяМассива[индекс позиции в массиве]
	int val1 = example[0]; // переменной val1 присваеваем значение первой позиции массива "example" - 1
	int val2 = example[2]; // переменной val2 присваеваем третью позицию массива "example" - 4
#pragma endregion

#pragma region Работа с элементами массива. Перебор массивов
	/* Допустим ситуацию, в которой нам нужно автоматизировать процесс - поработать с каждым элементом массива.
	Для этого можно воспользоваться конструкцией цикла for */

	// Напечатать каждый элемент массива в консоль
	cout << "Пример 1: вывод значений массива в консоль" << endl;
	int arraySize = size(example); // уточняем размер массива, если то нам не известно заранее
	for (int i = 0; i < arraySize; i++)
	{
		cout << example[i] << " ";
	}
	cout << endl << endl;

	/* Помимо этого, для подобных случаев есть отдельная конструкция for each (за каждый элемент).
	Выигрышной особенностью этой конструкции, в отличие от for, является то, что нам не требуется знать размерность массива,
	с которым проводятся манипуляции */

	// for (типПеременнойМассива имяУсловнойЕдиницы : имяМассива)
	cout << "Пример 2: обработка элементов массива внутри цикла" << endl;
	for (int element : example) // Каждый экземпляр "element" массива "example"
	{
		element += 3;
		cout << element << " ";
	}
	cout << endl;

	/* КАК ЭТО РАБОТАЕТ "ПОД КАПОТОМ"
	При переборе массива в каждой итерации переменной "element" присваевается значение из оригинала, затем увеличиваем ее значение на 3.
	Однако это приведет только к изменению этой переменной "element", оригинал в массиве example останется нетронутым. */
	cout << "Проверка сохранения данных оригинала" << endl;
	cout << "Оригинальные значения:";
	for (int i = 0; i < arraySize; i++)
	{
		cout << " " << example[i];
	} // Убедились, что данные не были задеты
	cout << endl << endl;

	/* Если для задачи требуется произвести правки в оригинале, то используем указатель на ячейку памяти оригинала*/
	cout << "Пример 2: обработка элементов массива внутри цикла c использованием указателей" << endl;
	for (int& element : example) // Каждый настоящий элемент массива "example"
	{
		element += 3;
		cout << element << " ";
	}
	cout << endl;
	cout << "Проверка редактирования данных оригинала" << endl;
	cout << "Оригинальные значения:";
	for (int i = 0; i < arraySize; i++)
	{
		cout << " " << example[i];
	} // Убедились, что данные были изменены
	cout << endl << endl;
#pragma endregion
#pragma endregion

#pragma region Многомерные массивы
	// Массив может быть многомерным
	int numbers2d[3][3] = {
		{1,5,7},
		{3,8,2},
		{9,4,6}
	}; // Грубо говоря, представляет из себя массив массивов целочисленных значений
	// Таким образом можно создавать большие размерности
#pragma region Работа с элементами многомерного массива. Обращение по индексу
	// Чтобы обратиться к элементу такого массива, нужно использовать индекс каждой размерности
	// Пример: Выведем в консоль последний элемент во втором ряду
	/* Держим в уме, что в начале идёт ряд, затем - столбец */
	cout << "Выведем в консоль последний элемент во втором ряду" << endl;
	cout << numbers2d[1][2] << endl << endl; // = 2
#pragma endregion

#pragma region Работа с элементами массива. Перебор многомерных массивов
	// Для того, чтобы перечислить данные многомерного массива, придётся использовать вложенные один в другой циклы
	cout << "Вывод в консоль двумерного массива:" << endl;
	for (int i = 0; i < 3; i++) // В каждом ряду
	{
		for (int j = 0; j < 3; j++) // В каждом столбце ряда
		{
			cout << numbers2d[i][j] << " ";
		}
		cout << std::endl;
	}
	cout << endl << endl;

	// for-each тоже работает
	cout << "Вывод в консоль двумерного массива, второй способ:" << endl;
	for (auto &rows : numbers2d) // Здесь без указателя на оригинал не обойтись, плюсы иначе не смогут определить количество столбцов в ряду
	{
		for (int number : rows)
		{
			cout << number << " ";
		}
		cout << endl;
	}
	cout << endl << endl;
#pragma endregion

#pragma endregion

#pragma region Текст. Представление как массив символов
	// Под капотом, объект, который хранит текст, представляет из себя массив символов.
	cout << "Пример вывода текста" << endl;
	cout << "hello!" /* для этого текста создаётся массив символов(char),
	размером по количеству символов - в данном случае, 7 = 6 + невидимый символ завершения строки: char с кодом 0.
	Он нужен, как точка в конце предложения - чтобы после конца текста не начать считывать байты памяти дальше */ << endl;

	char charArray[] = {'h', 'e', 'l', 'l', 'o', '!'}; // Полная форма инициализации текста - строкового литерала, 
	// которую мы в прошлых практиках передавали на вывод в консоль

	/* С первой практики помним, что базово char весит всего 1 байт и потому при его использовании доступно только 256 символов.
	Перечень этих символов можно посмотреть в таблице ASCII. https://cppreference.com/cpp/language/ascii 
	"Переведём" строку в коды символов для наглядности */
	cout << "Переводим буквы текста в ID символа" << endl;
	for(auto var : "hello!")
	{
		cout << (short)var << " "; // переводим char в число
	}
	cout << endl << endl;
	// Всё, что не влезло в ASCII (В том числе и кириллица), использует расширенную таблицу, 
	// и, соответственно, каждый символ может весить в два, а то и в четыре, раза больше, в зависимости от ОС и кодировок
	char charRusArray[]{ "Привет" }; // На windows каждый символ кириллицы занимает 2 байта, 
	// поэтому массив из 6 символов будет весить 6х2 + 1 пустой символ = 13 байт.

#pragma region Работа с массивами символов. Ввод текста с консоли
	/* Используя полученные знания, теперь мы можем реализовать ввод текста с консоли */
	const int maxRange = 20; // Определяем константу - предел считываемых символов
	char userInput[maxRange]; // Готовим память для текста с клавиатуры, обрабатываем не больше 20 символов
	cout << "Пример получения текста от пользователя. Введите текст. Чтобы закончить ввод, нажмите Enter." << endl;
	cin.getline(userInput, maxRange);
	cout << "Мы записали, как вы ввели: \"" << userInput << "\". Извините, если что-то не влезло." << endl;
#pragma endregion

#pragma region Лирическое отступление
	/* Если есть данное решение задач, зачем появился отдельный класс строк?
	* 
	* Данный подход работы с текстом - старая школа, происходящая корнями из языка С.
	* Весь подвох заключается в нулевом символе, ответственном за окончание строки. В случае, если мы начнём проводить манипуляции с текстом,
	* появляется риск убрать из массива символов / отредактировать нулевой символ, что приведёт к непредсказуемому поведению системы.
	* Поэтому, с точки зрения разработки, если задача требует работы с текстом сложнее, чем пример выше, данный подход не считается безопасным.
	* Для того, чтобы комплексно работать с текстом, был разработан отдельный класс std::string - строки. */
#pragma endregion
#pragma endregion

#pragma region Строки
	// Объект класса строки инициализируется, как и любые другие переменные:
	string example1 = "Текст"; // Пример 1
	string example2{ "Текст побольше" }; // Пример 2
	string example3("Текст совсем большой"); // Пример 3

	// Данный текст строки можно вывести так же, как и обычный
	cout << "Пример работы со строками: вывод в консоль" << endl;
	cout << example1 << endl << endl;

#pragma region Работа с текстом
	// Строки предоставляют те же механизмы работы, что и массивы символов
	cout << "Пример работы со строками: обращение к символу по индексу" << endl;
	string error = "ПрЫвет";
	cout << error << endl;
	error[2] = 'и'; // Исправляем ошибку - заменяем символ, присваивая ячейке новое значение
	cout << "После манипуляции получилось: " << error << endl << endl;

	// Так же как и с массивом символов, мы можем записывать в переменную строки текст с клавиатуры
	string input;
	cout << "Пример работы со строками: ввод с клавиатуры. Введите что-нибудь, как закончите - нажмите Enter." << endl;
	getline(cin, input); // для того, чтобы подключить вариант getline, способный работать со строками, #include <string>
	cout << "Вы ввели: \"" << input <<"\"" << endl << endl;
#pragma endregion

#pragma endregion

}

